MySQL_SpringBoot_Project/pizzaomssql/src/test/Artillary/ArtillaryTest_sql_60_30.txt
Started phase 0 (Warm up), duration: 60s @ 12:20:22(+0530) 2020-12-14
Report @ 12:20:32(+0530) 2020-12-14
Elapsed time: 10 seconds
  Scenarios launched:  299
  Scenarios completed: 299
  Requests completed:  299
  Mean response/sec: 30.11
  Response time (msec):
    min: 9.1
    max: 31.7
    median: 10.5
    p95: 12.2
    p99: 13.5
  Codes:
    200: 299

Report @ 12:20:42(+0530) 2020-12-14
Elapsed time: 20 seconds
  Scenarios launched:  300
  Scenarios completed: 300
  Requests completed:  300
  Mean response/sec: 30.03
  Response time (msec):
    min: 8.8
    max: 27.3
    median: 10.3
    p95: 11.5
    p99: 12.2
  Codes:
    200: 300

Report @ 12:20:52(+0530) 2020-12-14
Elapsed time: 30 seconds
  Scenarios launched:  300
  Scenarios completed: 300
  Requests completed:  300
  Mean response/sec: 30
  Response time (msec):
    min: 8.9
    max: 13.3
    median: 10.2
    p95: 11.6
    p99: 12.3
  Codes:
    200: 300

Report @ 12:21:02(+0530) 2020-12-14
Elapsed time: 40 seconds
  Scenarios launched:  300
  Scenarios completed: 300
  Requests completed:  300
  Mean response/sec: 30
  Response time (msec):
    min: 8.9
    max: 23.8
    median: 10.2
    p95: 11.7
    p99: 13.3
  Codes:
    200: 300

Report @ 12:21:12(+0530) 2020-12-14
Elapsed time: 50 seconds
  Scenarios launched:  300
  Scenarios completed: 300
  Requests completed:  300
  Mean response/sec: 30
  Response time (msec):
    min: 8.6
    max: 12.6
    median: 10.3
    p95: 11.5
    p99: 12.3
  Codes:
    200: 300

Report @ 12:21:22(+0530) 2020-12-14
Elapsed time: 1 minute, 0 seconds
  Scenarios launched:  300
  Scenarios completed: 300
  Requests completed:  300
  Mean response/sec: 30
  Response time (msec):
    min: 9
    max: 13.3
    median: 10.1
    p95: 11.5
    p99: 12.2
  Codes:
    200: 300

Report @ 12:21:22(+0530) 2020-12-14
Elapsed time: 1 minute, 0 seconds
  Scenarios launched:  1
  Scenarios completed: 1
  Requests completed:  1
  Mean response/sec: 2
  Response time (msec):
    min: 10.3
    max: 10.3
    median: 10.3
    p95: 10.3
    p99: 10.3
  Codes:
    200: 1

All virtual users finished
Summary report @ 12:21:22(+0530) 2020-12-14
  Scenarios launched:  1800
  Scenarios completed: 1800
  Requests completed:  1800
  Mean response/sec: 29.77
  Response time (msec):
    min: 8.6
    max: 31.7
    median: 10.3
    p95: 11.6
    p99: 12.6
  Scenario counts:
    Search and buy: 1800 (100%)
  Codes:
    200: 1800