MySQL_SpringBoot_Project/pizzaomssql/src/test/Artillary/artllarysql_post.txt
Started phase 0 (Warm up), duration: 60s @ 14:33:51(+0530) 2020-12-14
Report @ 14:34:01(+0530) 2020-12-14
Elapsed time: 10 seconds
  Scenarios launched:  299
  Scenarios completed: 299
  Requests completed:  299
  Mean response/sec: 30.11
  Response time (msec):
    min: 1.3
    max: 16.7
    median: 1.6
    p95: 2
    p99: 3.7
  Codes:
    400: 299

Warning: 
CPU usage of Artillery seems to be very high (pids: 84813)
which may severely affect its performance.
See https://artillery.io/docs/faq/#high-cpu-warnings for details.

Report @ 14:34:11(+0530) 2020-12-14
Elapsed time: 20 seconds
  Scenarios launched:  300
  Scenarios completed: 300
  Requests completed:  300
  Mean response/sec: 30.03
  Response time (msec):
    min: 1.1
    max: 3.7
    median: 1.3
    p95: 1.5
    p99: 2.2
  Codes:
    400: 300

Report @ 14:34:21(+0530) 2020-12-14
Elapsed time: 30 seconds
  Scenarios launched:  300
  Scenarios completed: 300
  Requests completed:  300
  Mean response/sec: 30
  Response time (msec):
    min: 0.9
    max: 19.5
    median: 1.2
    p95: 1.3
    p99: 1.7
  Codes:
    400: 300

Warning: High CPU usage warning (pids: 84813).
See https://artillery.io/docs/faq/#high-cpu-warnings for details.

Report @ 14:34:31(+0530) 2020-12-14
Elapsed time: 40 seconds
  Scenarios launched:  300
  Scenarios completed: 300
  Requests completed:  300
  Mean response/sec: 30.03
  Response time (msec):
    min: 0.9
    max: 1.8
    median: 1.1
    p95: 1.2
    p99: 1.4
  Codes:
    400: 300

Report @ 14:34:41(+0530) 2020-12-14
Elapsed time: 50 seconds
  Scenarios launched:  300
  Scenarios completed: 300
  Requests completed:  300
  Mean response/sec: 30
  Response time (msec):
    min: 0.9
    max: 4.8
    median: 1
    p95: 1.2
    p99: 2
  Codes:
    400: 300

Warning: High CPU usage warning (pids: 84813).
See https://artillery.io/docs/faq/#high-cpu-warnings for details.

Report @ 14:34:51(+0530) 2020-12-14
Elapsed time: 1 minute, 0 seconds
  Scenarios launched:  300
  Scenarios completed: 300
  Requests completed:  300
  Mean response/sec: 30.06
  Response time (msec):
    min: 0.8
    max: 2.7
    median: 1
    p95: 1.1
    p99: 1.6
  Codes:
    400: 300

Report @ 14:34:52(+0530) 2020-12-14
Elapsed time: 1 minute, 0 seconds
  Scenarios launched:  1
  Scenarios completed: 1
  Requests completed:  1
  Mean response/sec: 2
  Response time (msec):
    min: 0.9
    max: 0.9
    median: 0.9
    p95: 0.9
    p99: 0.9
  Codes:
    400: 1

All virtual users finished
Summary report @ 14:34:52(+0530) 2020-12-14
  Scenarios launched:  1800
  Scenarios completed: 1800
  Requests completed:  1800
  Mean response/sec: 29.78
  Response time (msec):
    min: 0.8
    max: 19.5
    median: 1.1
    p95: 1.7
    p99: 2.1
  Scenario counts:
    Search and buy: 1800 (100%)
  Codes:
    400: 1800